{
        "people" : [
                {
                        "name": "John Norwood",
                        "title": ["Managing Partner", "Counselor at Law"],
                        "bio": "Mr. Norwood is one of California's top legislative advocates and Managing Partner of Norwood Associates, LLC.  He is considered the leader in the state's insurance, financial services, and small business sector and represents a blue chip list of business, insurance, and financial clients.  His career has spanned more than 35 years in various capacities representing clients before the California Legislature and regulatory agencies.  During that time, Mr. Norwood was one of the chief lobbyists for the California Manufacturers Association; founded and managed the Sacramento law and lobbying office of Heron, Burchette Ruckert & Rothwell, a national political firm.  Mr. Norwood has been the Principal of Norwood Associates, LLC since 1990, representing numerous clients before the California Legislature and regulatory agencies.\n\nOne of the most experienced lobbyists in Sacramento, Mr. Norwood has earned a reputation as an expert in government relations, with access on both sides of the political aisle.  In 1980, the California Journal named him, “one of the rising stars in the lobbying business.”  In 2004, The Los Angeles Times stated: “for three decades Norwood has been in the middle of the scrum in most major insurance struggles in California.”  California's leading political magazine, Capitol Weekly, named him the “Most Trustworthy” lobbyist as a result of their 2010 poll of legislators and chiefs of staff.  His successes include hard-fought campaigns amending California's insurance rate regulatory statutes, reforming California's insurance agent and broker licensing laws, obtaining numerous amendments to California's privacy law for various clients, rebuffing challenges to title insurance and home warranty statutes, defending against amendments to California's franchise law as well as laws and regulations governing contractors and swimming pool and spa businesses.\n\nMr. Norwood graduated from California State University, Sacramento with a Bachelor's Degree in Government.  He earned his Juris Doctorate from the University of the Pacific, McGeorge School of Law and is an active member of the California State Bar.",
                        "picture": "../assets/pictures/John-Norwood-profile.jpg",
                        "email": "jnorwood@nalobby.net",
                        "education": [
                                {"school": "University of the Pacific - McGeorge School of Law", "degree": "Juris Doctorate", "area": null},
                                {"school": "California State University, Sacramento", "degree": "Bachelor of Arts", "area": "Political Science and Government"}
                        ],
                        "achievements": ["Capitol Weekly Top 100 (2022)", "Capitol Weekly Top 100 (2011)", "Top 50 Infuential People in Workers' Comp, 2010"]
                },
                {
                        "name": "Erin Norwood",
                        "title": "Partner",
                        "bio": "As a Partner of Norwood Associates, LLC, Ms. Norwood provides clients with more than two decades of experience and a strong understanding of insurance, technology, health, and consumer issues. Ms. Norwood has successfully lobbied the California Legislature, Governor's office, and State Administrative Agencies on significant issues such as workers' compensation, cable and internet legislation, pharmaceuticals, cannabis and tobacco, personal, property and life insurance, privacy and internet security, taxation, and gaming legislation.\n\nNorwood Associates, LLC's clients benefit from Ms. Norwood's familiarity of how client objectives are met through legislation, her knowledge of how California legislators perceive various issues and her bipartisan relationships with legislators and staff. Ms. Norwood recognizes the importance of being well versed in all aspects of her clients' issues as well as the necessity of keeping clients informed on the process and progress of legislation.\n\nMs. Norwood is also an active member of Capitol Network, a non-profit organization involved in uplifting and aiding women within the Capitol community. She has co-chaired Capitol Network's Annual Golf Tournament for five consecutive years, which funds grants to local charities.\n\nMs. Norwood is a graduate of California State University, Sacramento with a Bachelor's Degree in Communications Studies with an emphasis in Political Communications. Ms. Norwood also is a graduate of the University of the Pacific, McGeorge School of Law with a Master's of Science in Law.",
                        "picture": "../assets/pictures/Erin-Norwood-profile.jpg",
                        "email": "enorwood@nalobby.net",
                        "education": [
                                {"school": "University of the Pacific - McGeorge School of Law", "degree": "Master of Science in Law", "area": null},
                                {"school": "California State University, Sacramento", "degree": "Bachelor of Arts", "area": "Communication Studies & Political Communications"}
                        ],
                        "achievements": null
                },
                {
                        "name": "George Cavinta",
                        "title": "Legislative Associate",
                        "bio": "Mr. Cavinta, our esteemed Legislative Associate at Norwood Associates, plays a vital role in our firm by providing invaluable support in legislative tracking, analysis, fundraising, and observation of legislative and regulatory hearings. His keen eye for detail ensures that our clients stay informed and ahead of the ever-changing legislative landscape.\n\nThroughout his career, George has seized valuable opportunities to gain hands-on experience in the legal and political domains. As an intern for the Humboldt County Public Defender's Office and a Legal Assistant at the Gallegos Law Firm, he honed his legal acumen, gaining a strong understanding of legal processes and practices. As a Coordinator for the Democratic Party of Lane County, he played a pivotal role in the campaigns of Congressman Peter DeFazio and Governor John Kitzhaber, organizing and facilitating volunteers in their canvassing efforts as well as working closely with the Chair to plan and execute various events.\n\nAs a graduate of the University of Oregon, George holds a Bachelor of Arts in Political Science with a focus on Public Policy and Global Engagement, complemented by a minor in Legal Studies.",
                        "picture": "../assets/pictures/George-Cavinta-profile.jpg",
                        "email": "gcavinta@nalobby.net",
                        "education": [
                                {"school": "University of Oregon", "degree": "Bachelor of Arts", "area": "Political Science and Government"}
                        ],
                        "achievements": null
                },
                {
                        "name": "Kaitlyn Preston",
                        "title": "Legislative Aide",
                        "bio": "Ms. Preston, our esteemed Legislative Aide at Norwood Associates, contributes significantly to our firm by tracking and analyzing legislation, attending legislative hearings, and monitoring regulatory activity for our clients.\n\nThroughout her career, Ms. Preston has excelled in both city and state government roles. As an intern for San Diego Mayor Todd Gloria, she gained valuable insight into the workings of city government in a major urban area. In this capacity, she assisted the communications department and represented the mayor's office at various fundraisers. As a Committee Assistant for the California Senate Insurance Committee, Ms. Preston contributed to the legislative process by supporting insurance-related legislation, assisting in hearings, and attending stakeholder meetings.\n\nMs. Preston holds a Bachelor's Degree in Political Science, with a minor in Communication, from San Diego State University. She is currently pursuing her Master's Degree in Political Science through Indiana University's online program.",
                        "picture": "../assets/pictures/Kaitlyn-Preston-profile.png",
                        "email": "kpreston@nalobby.net",
                        "education": [
                                {"school": "Indiana University Northwest", "degree": "Master of Arts", "area": "Political Science and Government"},
                                {"school": "San Diego State University", "degree": "Bachelor of Arts", "area": "Political Science and Government"}
                        ],
                        "achievements": null
                }
                
        ]
        
}